<strong>NumPy</strong>
-- Foundational data structure, in Python, and powerful tool in which other powerful tools are built upon, such as SciPy, Matplotlib, Pandas, Scikit-Learn and more.
* Low level data structure(np.array)
* Large multidimensional arrays and matrices
* Wide range of mathematical operations can be performed on data structures
* `import numpy as np`

<strong>Pandas</strong>
-- Python library which provides high performance easy to use data structures and data analysis tools. Runs on top of NumPy (NumPy is a dependency of Pandas), so if you type `conda install pandas` in your terminal NumPy will also install automatically. Popular for data science, financial modeling, statistics, etc. 
* High level data structure (dataframes)
* More suited for dealing with `tabular` data (spreadsheets)
* Data alignment, fills in missing data, makes date friendlier to work with, etc.
* `import pandas as pd`

<strong>Comblined</strong>
* Use NumPy's calculation capabilities with Pandas' data structuring models to yield powerful and visual results

### Import packages

In [5]:
import pandas as pd
import numpy as np

### Create dataframe

In [3]:
user = [
    {
        'id': '1',
        'first': 'Matt',
        'last': 'Miller',
        'email': 'matt@email.com'
    },
    {
        'id': '2',
        'first': 'Winnie',
        'last': 'Reff',
        'email': 'win@email.com'
    }
]

In [11]:
data = [
    ['Student A', 92, 88, 54, 22, 58],
    ['Student B', 62, 48, 54, 62, 58],
    ['Student C', 92, 82, 54, 22, 88],
    ['Student D', 29, 88, 54, 22, 58],
]

df = pd.DataFrame(data=data, columns=['Name', 'Q1', 'Q2', 'Q3', 'Q4', 'Q5'])
df

        Name  Q1  Q2  Q3  Q4  Q5
0  Student A  92  88  54  22  58
1  Student B  62  48  54  62  58
2  Student C  92  82  54  22  88
3  Student D  29  88  54  22  58

### Show data types,  indexes, columns, values

In [12]:
df.head()

        Name  Q1  Q2  Q3  Q4  Q5
0  Student A  92  88  54  22  58
1  Student B  62  48  54  62  58
2  Student C  92  82  54  22  88
3  Student D  29  88  54  22  58

In [13]:
df.tail()

        Name  Q1  Q2  Q3  Q4  Q5
0  Student A  92  88  54  22  58
1  Student B  62  48  54  62  58
2  Student C  92  82  54  22  88
3  Student D  29  88  54  22  58

In [ ]:
# 32 byte integer (int32) : 0 ~ 2,100,000,000
# 64 byte integer (int64) : 0 ~ 9,000,000,000000,000,000

In [25]:
df.dtypes

Name    object
Q1       int64
Q2       int64
Q3       int64
Q4       int64
Q5       int64
dtype: object

### Statistical summary of data

In [18]:
df.describe()

              Q1         Q2    Q3    Q4    Q5
count   4.000000   4.000000   4.0   4.0   4.0
mean   68.750000  76.500000  54.0  32.0  65.5
std    30.037477  19.209373   0.0  20.0  15.0
min    29.000000  48.000000  54.0  22.0  58.0
25%    53.750000  73.500000  54.0  22.0  58.0
50%    77.000000  85.000000  54.0  22.0  58.0
75%    92.000000  88.000000  54.0  32.0  65.5
max    92.000000  88.000000  54.0  62.0  88.0

In [22]:
df1 = df.T

In [24]:
df1.head()

              0          1          2          3
Name  Student A  Student B  Student C  Student D
Q1           92         62         92         29
Q2           88         48         82         88
Q3           54         54         54         54
Q4           22         62         22         22

### Basic informatino about dataframe

### Sort all values by certain criteria

In [27]:
df.sort_values('Q1', ascending=False)

        Name  Q1  Q2  Q3  Q4  Q5
0  Student A  92  88  54  22  58
2  Student C  92  82  54  22  88
1  Student B  62  48  54  62  58
3  Student D  29  88  54  22  58

### Slicing data

In [29]:
df[2:5]

        Name  Q1  Q2  Q3  Q4  Q5
2  Student C  92  82  54  22  88
3  Student D  29  88  54  22  58

### Filtering

In [30]:
df[['Name', 'Q3', 'Q4']]

        Name  Q3  Q4
0  Student A  54  22
1  Student B  54  62
2  Student C  54  22
3  Student D  54  22

In [32]:
df.loc[3]

Name    Student D
Q1             29
Q2             88
Q3             54
Q4             22
Q5             58
Name: 3, dtype: object

In [33]:
df[df['Q1'] > 50]

        Name  Q1  Q2  Q3  Q4  Q5
0  Student A  92  88  54  22  58
1  Student B  62  48  54  62  58
2  Student C  92  82  54  22  88

In [35]:
df[df.Name.isin(['Student B', 'Student D'])]

        Name  Q1  Q2  Q3  Q4  Q5
1  Student B  62  48  54  62  58
3  Student D  29  88  54  22  58

In [37]:
df

        Name  Q1  Q2  Q3  Q4  Q5
0  Student A  92  88  54  22  58
1  Student B  62  48  54  62  58
2  Student C  92  82  54  22  88
3  Student D  29  88  54  22  58

In [39]:
# change all values on Q5 to 100
df.loc[:, 'Q5'] = 100
df

        Name  Q1  Q2  Q3  Q4   Q5
0  Student A  92  88  54  22  100
1  Student B  62  48  54  62  100
2  Student C  92  82  54  22  100
3  Student D  29  88  54  22  100

In [40]:
df.columns[1:]

Index(['Q1', 'Q2', 'Q3', 'Q4', 'Q5'], dtype='object')

In [41]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [42]:
df.loc[:, df.columns[1:]]

   Q1  Q2  Q3  Q4   Q5
0  92  88  54  22  100
1  62  48  54  62  100
2  92  82  54  22  100
3  29  88  54  22  100

In [50]:
df['Averages'] = (df[]) / 5

SyntaxError: invalid syntax (<ipython-input-50-414d01650a5e>, line 1)

In [54]:
df['avg'] = np.mean([q1, q2, q3, q4, q5])
df

NameError: name 'q1' is not defined

In [44]:
df.rename(lambda c: c.lower(), axis=1, inplace=True)
df

        name  q1  q2  q3  q4   q5
0  Student A  92  88  54  22  100
1  Student B  62  48  54  62  100
2  Student C  92  82  54  22  100
3  Student D  29  88  54  22  100

### Assignment

### Rename columns

### Interate over dataframe

In [45]:
for idx, row in dt.iterrows():
    print(f'{idx} {row['name']} {row.average}')

SyntaxError: invalid syntax (<ipython-input-45-5f982b5c224e>, line 2)

### Save to CSV file

In [48]:
df.to_csv('new_data.csv', index=False)

In [49]:
new_df = pd.read_csv('new_data.csv')
new_df

        name  q1  q2  q3  q4   q5
0  Student A  92  88  54  22  100
1  Student B  62  48  54  62  100
2  Student C  92  82  54  22  100
3  Student D  29  88  54  22  100

### Load data from CSV file into Jupyter Notebook as a Pandas dataframe

In [3]:
from datetime import datetime as dt
import datetime

In [6]:
engagements = pd.read_csv('engagements.csv')
enrollments = pd.read_csv('enrollments.csv')
submissions = pd.read_csv('submissions.csv')

In [13]:
enrollments['cancel_date'] = pd.to_datetime(enrollments['cancel_date'], format='%Y-%m-%d')
enrollments['join_date'] = pd.to_datetime(enrollments['join_date'], format='%Y-%m-%d')

In [14]:
enrollments['join_days'] = enrollments['cancel_date'] - enrollments['join_date']
# may delete the original days_to_cancel, this format is better

In [15]:
engagements['utc_date'] = pd.to_datetime(engagements['utc_date'], format='%Y-%m-%d')

In [16]:
submissions['creation_date'] = pd.to_datetime(submissions['creation_date'], format='%Y-%m-%d')
submissions['completion_date'] = pd.to_datetime(submissions['completion_date'], format='%Y-%m-%d')

In [17]:
engagements.rename(columns={'acct': 'account_key'}, inplace=True)

In [18]:
submissions.head(3)

,creation_date,completion_date,assigned_rating,account_key,lesson_key,processing_state
0,2018-01-14,2018-01-16,UNGRADED,256,3176718735,EVALUATED
1,2018-01-10,2018-01-13,INCOMPLETE,256,3176718735,EVALUATED
2,2018-01-20,2018-01-20,PASSED,256,3176718735,EVALUATED

In [19]:
engagements.head(3)

,account_key,utc_date,num_courses_visited,total_minutes_visited,lessons_completed,projects_completed
0,0,2018-01-09,1,11.679374,0,0
1,0,2018-01-10,2,37.284887,0,0
2,0,2018-01-11,2,53.633746,0,0

In [20]:
enrollments.head(3)

,account_key,status,join_date,cancel_date,days_to_cancel,is_enrolled,is_canceled,join_days
0,700,canceled,2017-11-10,2017-11-16,6.0,False,True,6 days
1,429,canceled,2017-11-10,2018-03-10,120.0,False,True,120 days
2,429,canceled,2018-03-10,2018-06-17,99.0,False,True,99 days

In [21]:
# How many unique records in each dataset (unique account keys)?

unique_enrollments = enrollments.drop_duplicates('account_key')
unique_engagements = engagements.drop_duplicates('account_key')
unique_submissions = submissions.drop_duplicates('account_key')
print(f'Enrollments\t Unique: {unique_enrollments.shape[0]}\t Original: {enrollments.shape[0]}')
print(f'Engagements\t Unique: {unique_engagements.shape[0]}\t Original: {engagements.shape[0]}')
print(f'Submissions\t Unique: {unique_submissions.shape[0]}\t Original: {submissions.shape[0]}')

Enrollments	 Unique: 1302	 Original: 1640
Engagements	 Unique: 1237	 Original: 136240
Submissions	 Unique: 743	 Original: 3642

In [22]:
# Possible test accounts? is_enrolled = True in enrollments dataset

possible_test_accts = enrollments[enrollments['is_enrolled']].drop_duplicates('account_key')
print(f'Possible test accounts: {possible_test_accts.shape[0]}')

Possible test accounts: 6

In [23]:
# Remove the test account records from the 3 datasets using the account key found in cell above

true_enrollments = enrollments[~enrollments['account_key'].isin(possible_test_accts['account_key'])]
true_engagements = engagements[~engagements['account_key'].isin(possible_test_accts['account_key'])]
true_submissions = submissions[~submissions['account_key'].isin(possible_test_accts['account_key'])]
print(f'Enrollments\t Unique: {true_enrollments.shape[0]}\t Original: {enrollments.shape[0]}')
print(f'Engagements\t Unique: {true_engagements.shape[0]}\t Original: {engagements.shape[0]}')
print(f'Submissions\t Unique: {true_submissions.shape[0]}\t Original: {submissions.shape[0]}')

Enrollments	 Unique: 1622	 Original: 1640
Engagements	 Unique: 135656	 Original: 136240
Submissions	 Unique: 3634	 Original: 3642

In [171]:
true_enrollments['cancel_date'].count()

973

In [24]:
# Quality accounts
# account is currently active (is_canceled is False)
# days_to_cancel > 7 (past the trial period)
# latest valid record for each particular valid user
quality_accounts = true_enrollments[~true_enrollments['is_canceled'].isna()]
quality_accounts = quality_accounts[~quality_accounts['cancel_date'].isna()]
quality_accounts = quality_accounts[(~quality_accounts['is_canceled']) | (quality_accounts['days_to_cancel'] > 7)]

quality_accounts.shape[0]
# this isn't quite lining up with original result shown in class, but moving on

566

In [25]:
# How many students were active on the website within the first week?
# This does match up with the numbers in class

quality_enrollments = true_enrollments[true_enrollments['account_key'].isin(quality_accounts['account_key'])]
quality_engagements = true_engagements[true_engagements['account_key'].isin(quality_accounts['account_key'])]
quality_submissions = true_submissions[true_submissions['account_key'].isin(quality_accounts['account_key'])]
print(f'Enrollments\t Quality: {quality_enrollments.shape[0]}\t Original: {enrollments.shape[0]}')
print(f'Engagements\t Quality: {quality_engagements.shape[0]}\t Original: {engagements.shape[0]}')
print(f'Submissions\t Quality: {quality_submissions.shape[0]}\t Original: {submissions.shape[0]}')

Enrollments	 Quality: 719	 Original: 1640
Engagements	 Quality: 55675	 Original: 136240
Submissions	 Quality: 1110	 Original: 3642

In [35]:
# Out of all of the students who lasted past the free trial, 
# how many of them were also active on the website within the first week?

# new df, only keep the latest engagement date
engagements_by_date = quality_engagements.sort_values(by='utc_date', ascending=False).drop_duplicates(subset='account_key', keep="last")
# df.sort_values('DATE_CHANGED').drop_duplicates('STATION_ID',keep='last')
# first_week = quality_engagements[engagements_by_date]
engagements_by_date

# need to think on this one a bit more...

,account_key,utc_date,num_courses_visited,total_minutes_visited,lessons_completed,projects_completed
118132,856,2018-07-18,0,0.000000,0,0
131600,1205,2018-07-17,0,0.000000,0,0
130567,1178,2018-07-16,0,0.000000,0,0
126415,1075,2018-06-09,1,24.787527,0,0
116848,804,2018-06-09,0,0.000000,0,0
...,...,...,...,...,...,...
44279,258,2017-11-10,2,180.035109,0,0
26650,157,2017-11-10,2,150.742167,0,0
102937,601,2017-11-10,0,0.000000,0,0
114557,752,2017-11-10,0,0.000000,0,0
423,3,2017-11-10,2,136.183600,0,0

In [36]:
# What was the most popular lesson?

submissions.value_counts('lesson_key')

# 3176718735 was the most popular lesson

lesson_key
3176718735    1503
3168208620     669
3165188753     622
3174288624     298
4576183932     193
4582204201     185
3184238632     127
4110338963      30
746169184        8
4180859007       6
3562208770       1
dtype: int64

In [39]:
# Which accounts have visited the most courses?

courses_visited = engagements.groupby('account_key').num_courses_visited.sum()
courses_visited.sort_values(ascending=False).head(5)

account_key
1098    231
37      207
119     203
428     199
198     197
Name: num_courses_visited, dtype: int64

In [41]:
# merge a couple of DF's together

engage_and_enroll = pd.merge(unique_engagements, unique_enrollments, how="inner", on='account_key')
engage_and_enroll

,account_key,utc_date,num_courses_visited,total_minutes_visited,lessons_completed,projects_completed,status,join_date,cancel_date,days_to_cancel,is_enrolled,is_canceled,join_days
0,0,2018-01-09,1,11.679374,0,0,current,2018-01-09,NaT,NaN,False,False,NaT
1,1,2018-05-06,1,9.640248,0,0,current,2018-05-06,NaT,NaN,False,False,NaT
2,2,2018-06-08,0,0.000000,0,0,current,2018-06-08,NaT,NaN,False,False,NaT
3,3,2017-11-10,2,136.183600,0,0,canceled,2017-11-10,2018-03-10,120.0,False,True,120 days
4,4,2018-05-12,0,0.000000,0,0,current,2018-05-12,NaT,NaN,False,False,NaT
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1232,1300,2017-11-10,1,2.625080,0,0,canceled,2017-11-10,2017-11-16,6.0,False,True,6 days
1233,1301,2018-04-03,1,6.202126,0,0,canceled,2018-04-03,2018-04-04,1.0,False,True,1 days
1234,1302,2018-07-18,0,0.000000,0,0,current,2018-07-18,NaT,NaN,False,False,NaT
1235,1303,2017-11-14,2,35.315063,0,0,canceled,2017-11-14,2018-01-14,61.0,False,True,61 days
1236,1305,2018-05-12,1,2.056223,0,0,canceled,2018-05-12,2018-06-19,38.0,False,True,38 days